Tekla.Structures.ModelInternal.ICDelegate


Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectHighlight(Tekla.Structures.ModelInternal.dotUIModelObjectHighlighter_t@)
DO NOT USE! For internal usage only!
pHighlightor:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectSelect(Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t@)
DO NOT USE! For internal usage only!
pSelector:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectsPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportTaskObjectAttach(Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t@)
DO NOT USE! For internal usage only!
pSelector:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreatePart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to create
contour: The part contour points
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly: The assembly to create.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportValidateLoftedPlate(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)
DO NOT USE! For internal usage only!
baseCurves:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCompareObjects(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ObjectId:
ObjectToCompareId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSplitBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
Returns: True on succes

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
imagePoints:
slopes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateReferenceModelObjectAttributeEnumerator(Tekla.Structures.ModelInternal.dotReferenceModelObjectAttributeEnumerator_t@)
DO NOT USE! For internal usage only!
pEnumerator:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateReferenceModelObjectAttribute(Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t@)
DO NOT USE! For internal usage only!
pRMOAttribute:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByParts(System.Int32,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByPartsAndRadius(System.Int32,System.Int32,System.Double)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateConicalBentPlateByPartsAndRadiusAperture(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateConicalBentPlateByPartsAndTwoRadiuses(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByFacesAndRadius(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateConicalBentPlateByFacesAndRadiusAperture(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double,System.Double)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesWithRadius(System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesWithRadiusAperture(System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
side1Start:
side1End:
side2Start:
side2End:
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesByPointsWithRadius(System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesByPointsWithRadiusAperture(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGeometryTreeCylindricalNodeRadius(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyConicalNodeRadiuses(System.Int32,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGeometryTreeConicalNodeByScale(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGeometryTreeCylindricalNodeCurveType(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGeometryTreePolygonNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExplodeBentPlate(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportSetNewBentPlateRoot(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId: The node identifier.
clientId: The client identifier.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBendAngle(System.Double,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
angle: The angle.
curvedNodeId: The node identifier.
movingNodeId: The direction node identifier.
clientId: The client identifier.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportExtractBentPlateFromComponent(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBendSurfaceNode(System.Int32,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
firstBoundaryPoints:
secondBoundaryPoints:
surfacePoints:
clientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetBentPlateMinimumRadius(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetBentPlateMaximumRadiuses(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetSpiralBeamEndPoint(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotVector_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportDisplayComponentHelp(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDisplayAutoDefaultSettings(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportStartCustomComponentCreation(System.String)
DO NOT USE! For internal usage only!
ComponentName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportStartPluginCreation(System.String)
DO NOT USE! For internal usage only!
ComponentName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentGetAttributeFileExtension(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String@)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileExtension: The file extension.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentSaveAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileName: The file name.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentLoadAndSaveToAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileName: The file name.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentGetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
ignoreDefaultValues: Fetch also attributes with default attribute values.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentSetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
addNewAttributes: Are new attributes registered to internal component data storage.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportComponentDeleteAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
attributeNames: The applied attribute names.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportValidatePolymesh(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@,Tekla.Structures.ModelInternal.dotPolymeshValidateInvalidInfo_t@)
DO NOT USE! For internal usage only!
checkCriteria: The checking criteria.
polymeshToValidate: The polymesh to be checked.
invalidInfo: The checking results.
Returns: True if valid, false if error found

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSolidBrep(Tekla.Structures.ModelInternal.dotPolymesh_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
DO NOT USE! For internal usage only!
polymeshToClean: The polymesh to be cleaned.
polymeshCleaned: The cleaned polymesh.
Returns: True if the polymesh can be solid, otherwise false.

Tekla.Structures.ModelInternal.ICDelegate.ExportCreatePourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSplitPart(System.Int32,Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
PartId: ID of the part to be split
pSplit: Polymesh defining the split geometry
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetFatherComponent(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
ObjectId:
FatherComponentId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPolybeamCoordinateSystem(System.Int32,System.Int32,System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
Id:
SubId:
Chamfered:
pX:
pY:
pZ:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCalculateContourPolygon(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
polygon: The polygon.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPartLine(Tekla.Structures.ModelInternal.dotPartLine_t@)
DO NOT USE! For internal usage only!
pPartLine:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The bent plate to select
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to select
contour: The part contour points
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32@)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportFormatProfile(Tekla.Structures.ModelInternal.dotProfile_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportParseProfile(Tekla.Structures.ModelInternal.dotProfile_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectBoltGroup(System.Double@,System.Double@,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@,System.Collections.ArrayList@)
DO NOT USE! For internal usage only!
pNumberOfBolts:
pDiameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
pBoltPositions:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}})
DO NOT USE! For internal usage only!
boltId: The bolt identifier.
holeElevations: The hole elevations.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetWeldGeometry(Tekla.Structures.ModelInternal.dotWeldGeometry_t@)
DO NOT USE! For internal usage only!
pWeldGeometry:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectSingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarBars(Tekla.Structures.ModelInternal.dotWire_t@)
DO NOT USE! For internal usage only!
pWire:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetRebarComplexGeometries(Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetRebarPluginData(Tekla.Structures.ModelInternal.dotRebarPluginData_t@,System.Collections.Generic.IList{System.Double}@,System.Collections.Generic.IList{System.Double}@,System.Collections.Generic.IList{System.Double}@)
DO NOT USE! For internal usage only!
data:
bendingRadii:
bendingAngles:
legLengths:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetVirtualBarIdentifiersByGuid(Tekla.Structures.Internal.dotIdentifier_t@,System.Collections.Generic.IList{System.Int32}@)
DO NOT USE! For internal usage only!
inputId:
outputIds:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
slopes:
imagePoints:
pControlObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectReferenceModelObject(Tekla.Structures.ModelInternal.dotReferenceModelObject_t@)
DO NOT USE! For internal usage only!
pReferenceModelObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPourObject(Tekla.Structures.ModelInternal.dotPourObject_t@)
DO NOT USE! For internal usage only!
pPourObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@)
DO NOT USE! For internal usage only!
pPourUnit: The reference of selected pour unit
Returns: True if selected

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to modify
contour: The part contour points
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The part to modify
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.RunTqlQuery(Tekla.Structures.ModelInternal.dotUseTql_t@)
DO NOT USE! For internal usage only!
tql:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifySurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifySingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
imagePoints:
slopes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPourObject(Tekla.Structures.ModelInternal.dotPourObject_t@)
DO NOT USE! For internal usage only!
pPourObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@)
DO NOT USE! For internal usage only!
pPourUnit:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAddToPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
inputPour:
clientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRemoveFromPourUnit(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
clientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCalculatePourUnits
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAppendMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportAddShapeMetadata(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
key: Metadata key
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportUpdateShapeMetadata(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
key: Metadata key
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetShapeMetadataVal(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
key: Metadata key
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetShapeAllMetadataKeys(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteMetadata(System.String,System.String)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
key: Metadata key
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetHandlePoints(Tekla.Structures.ModelInternal.dotClientId_t,System.String,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@)
DO NOT USE! For internal usage only!
clientId:
guid:
handlePoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetHandlePoints(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
Set the Shape Item Handle Points
clientId:
guid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRefreshReferenceFile(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetReferenceModelRevisionIds(Tekla.Structures.ModelInternal.dotReferenceModel_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
ClientId:
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectReferenceModelRevision(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotReferenceModelRevision_t@)
DO NOT USE! For internal usage only!
modelId:
revisionId:
pRevision:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRemoveReferenceModelRevision(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
modelId:
revisionId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetAsCurrentRevision(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
modelId:
revisionId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetBasePoints(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
ClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectBasePoint(System.String,Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
guid:
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportConvertToBasePoint(System.String,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
basePointGuid:
pPoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportConvertFromBasePoint(System.String,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
basePointGuid:
pPoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetAsCurrentBasePoint(System.String,System.Int32)
DO NOT USE! For internal usage only!
basePointGuid:
value:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAttachPointCloud(Tekla.Structures.ModelInternal.dotPointCloud_t@)
DO NOT USE! For internal usage only!
pPointCloud:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDetachPointCloud(System.String)
DO NOT USE! For internal usage only!
pointCloudGuid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPointClouds(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
ClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPointCloudVisibleInViews(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
ClientId:
pointCloudGuid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectPointCloud(System.String,Tekla.Structures.ModelInternal.dotPointCloud_t@)
DO NOT USE! For internal usage only!
pointCloudGuid:
pPointCloud:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetPointCloudVisibility(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
pointCloudGuid:
viewObjectId:
visible:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDaoFindObject(System.Int32,System.String,System.String,System.Int32)
DO NOT USE! For internal usage only!
parentId:
type:
name:
position:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCleanDrawingFiles(System.Boolean,System.String)
DO NOT USE! For internal usage only!
Silent:
BackupPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetFatherReferenceAssemblyId(System.Int32)
DO NOT USE! For internal usage only!
referenceObjectId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportHierarchicDefinition(Tekla.Structures.ModelInternal.dotHierarchicDefinition_t@)
DO NOT USE! For internal usage only!
pHierarchicDefinition:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportHierarchicObject(Tekla.Structures.ModelInternal.dotHierarchicObject_t@)
DO NOT USE! For internal usage only!
pHierarchicObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportHierarchicObjectChildrenOperation(Tekla.Structures.ModelInternal.dotHierarchicList_t@)
DO NOT USE! For internal usage only!
pHierarchicList:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetBuildingHierarchyChildObjectGuids(Tekla.Structures.ModelInternal.dotBuildingHierarchyOperation_t@)
DO NOT USE! For internal usage only!
Operation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyOperation_t@)
DO NOT USE! For internal usage only!
Operation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchySiteOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t@)
DO NOT USE! For internal usage only!
Site:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyBuildingOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
Building: The building
contour: The contour points.
Returns: The success of operation.

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyStoreyOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t@)
DO NOT USE! For internal usage only!
StoreyOperation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyOverrideOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t@)
DO NOT USE! For internal usage only!
OverrideOperation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyGetObjectsOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t@)
DO NOT USE! For internal usage only!
GetObjectsOperation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingSpacesOperation(Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
operation: The operation structure.
contour: The contour.
Returns: Positive if success.

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteObject(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pIdentifier:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportEnumerateObjects(Tekla.Structures.ModelInternal.dotEnumerator_t@)
DO NOT USE! For internal usage only!
pEnumerator:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetStringPropertyToDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportGetStringPropertyFromDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Boolean)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportFetchFromDatabase(System.Collections.Generic.List{System.String}@,System.Boolean)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportFetchFromDatabaseWithIds(System.Collections.Generic.List{System.Int32}@,System.Boolean)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
dotSolid:
serializedFaceList:
serializedVectorList:
serializedShellIndexList:
serializedFaceOriginIdList:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSolidMerged(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
DO NOT USE! For internal usage only!
dotSolid: The dot solid.
polymeshes: The polymeshes.
Returns:
Success or error code of getting polymeshes for dot solid.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCutSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSolid(Tekla.Structures.ModelInternal.dotSolid_t@)
DO NOT USE! For internal usage only!
pSolid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetIntersectionSolid(Tekla.Structures.ModelInternal.dotIntersectionSolid_t@)
DO NOT USE! For internal usage only!
pSolid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetIntersectionPoints(Tekla.Structures.ModelInternal.dotIntersectionPoints_t@)
DO NOT USE! For internal usage only!
pIntersectionPoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCommitChanges(Tekla.Structures.ModelInternal.dotModelCommit_t@)
DO NOT USE! For internal usage only!
pModelCommit:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRunOrStopClashCheck(System.Boolean)
DO NOT USE! For internal usage only!
RunningClashCheck:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRunClashCheckWithOptions(System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
DO NOT USE! For internal usage only!
betweenReferenceModels:
betweenReferenceModelsAndComponents:
objectsInsideReferenceModels:
minDistance:
betweenParts:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetIntersectionBoundingBoxes(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Identifier1:
Identifier2:
ClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetDetectedClash(Tekla.Structures.ModelInternal.dotClash_t@)
DO NOT USE! For internal usage only!
pClash:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetNumberOfClashes(System.Int32@)
DO NOT USE! For internal usage only!
pClashes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCommandStatus(System.String@,System.String@,System.Boolean@)
DO NOT USE! For internal usage only!
TSCommand:
TSCommandParam:
Status:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetTrackEvent(System.String@,System.String@,System.String@)
DO NOT USE! For internal usage only!
category:
eventName:
eventContent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetViewIdFromCameraChangedEvent(System.Int32@)
DO NOT USE! For internal usage only!
pViewId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCommitData(Tekla.Structures.Internal.dotIdentifier_t@,System.Int32@,System.Int32@,System.Int32@,System.Int32@)
DO NOT USE! For internal usage only!
pId:
pObjectType:
pObjectSubType:
pCommitType:
pCommitSourceType:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetDotType(Tekla.Structures.ModelInternal.dotModelObject_t@)
DO NOT USE! For internal usage only!
pModelObject:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPartMark(Tekla.Structures.ModelInternal.dotPartMark_t@)
DO NOT USE! For internal usage only!
pPartMark:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCoordinateSystem(Tekla.Structures.ModelInternal.dotModelObject_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
pModelObject:
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
pAssembly:
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportHasUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPlane(Tekla.Structures.ModelInternal.dotPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetPlane(Tekla.Structures.ModelInternal.dotPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetTransformationPlane(Tekla.Structures.ModelInternal.dotTransformationPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTransformationPlane(Tekla.Structures.ModelInternal.dotTransformationPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPointInputChangedEvent(System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint}@)
DO NOT USE! For internal usage only!
pPoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportStartPolyLineInputGeometry(Tekla.Structures.ModelInternal.dotInputGeometry_t@,System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint}@)
DO NOT USE! For internal usage only!
pClientID:
pPoints:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetProperty(Tekla.Structures.ModelInternal.dotSetProperty_t@)
DO NOT USE! For internal usage only!
pProperty:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetProperties(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSetProperty_t})
DO NOT USE! For internal usage only!
Properties:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetAllReportProperties(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGetProperties_t}@)
DO NOT USE! For internal usage only!
pProperties:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetAllProperties(Tekla.Structures.ModelInternal.dotGetProperties_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pProperties:
pNames:
pValues:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetProperties(Tekla.Structures.ModelInternal.dotGetProperties_t@)
Calls dotExportGetProperties.
pProperties:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSetModelInfo(Tekla.Structures.ModelInternal.dotModelInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetProjectInfo(Tekla.Structures.ModelInternal.dotProjectInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyProjectInfo(Tekla.Structures.ModelInternal.dotProjectInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportInitializeComponentStacks
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAddComponentAttributeToStack(Tekla.Structures.ModelInternal.dotComponentAttribute_t@)
DO NOT USE! For internal usage only!
pAttr:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAddComponentInputToStack(Tekla.Structures.ModelInternal.dotComponentInputObject_t@)
DO NOT USE! For internal usage only!
pObj:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetComponentInput(Tekla.Structures.ModelInternal.dotComponentInputObject_t@)
DO NOT USE! For internal usage only!
pObj:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportLoadComponentAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetComponentAttribute(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotComponentAttribute_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pAttribute:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetNumberingUpToDate(Tekla.Structures.ModelInternal.dotNumberingQuery_t@)
DO NOT USE! For internal usage only!
pNumberingQuery:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetIsNumberingAllowed
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetSimilarNumberedObjects(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pClientId:

Tekla.Structures.ModelInternal.ICDelegate.ExportNumGetObjectsTransformation(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
object1Id: Object 1 id
object2Id: Object 2 id
cs1: Cs 1
cs2: Cs 2
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateReport(Tekla.Structures.ModelInternal.dotCreateReportFromModel_t@)
DO NOT USE! For internal usage only!
aReport:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDisplayReport(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.DisplayPrintReportDialog(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.RegisterExcelDialogOpeningCallback(Tekla.Structures.Model.Internal.IReportingExcelDialogCallback)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDisplayPrompt(System.String)
DO NOT USE! For internal usage only!
message:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The Data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The Data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.ICDelegate.ExportTryGetSubdirectoryFromFileName(Tekla.Structures.ModelInternal.dotTryGetSubdirectoryFromFileName_t@)
DO NOT USE! For internal usage only!
data: The Data.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetAttributeFileSubdirectory(Tekla.Structures.ModelInternal.dotTryGetSubdirectoryFromFileName_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportClearAttributeFileCache
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportWriteToSessionLog(System.String)
DO NOT USE! For internal usage only!
Message:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportWriteErrorToSessionLog(System.String)
DO NOT USE! For internal usage only!
message:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateNC(Tekla.Structures.ModelInternal.dotCreateNCFromModel_t@)
DO NOT USE! For internal usage only!
aNC:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateNCStructure(Tekla.Structures.ModelInternal.dotCreateNCFromModel_t@,Tekla.Structures.ModelInternal.dotDstvHeader@,Tekla.Structures.ModelInternal.dotDstvContours@,Tekla.Structures.ModelInternal.dotDstvHoles@,Tekla.Structures.ModelInternal.dotDstvMarks@,Tekla.Structures.ModelInternal.dotDstvBentLines@,Tekla.Structures.ModelInternal.dotDstvNumerations@)
DO NOT USE! For internal usage only!
aDotCreateNCFromModel:
pDstvHeader:
pDstvContours:
pDstvHoles:
pDstvMarks:
pDstvBentLines:
pDstvNumeration:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ImportExternalRefenceModel(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ImportOverlayModelWithMetadata(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.UpdateOverlayModel(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModel(System.String,Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
path:
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetImportedExternalReferenceModels(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.RemoveExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ShowExternalReferenceModel(System.String,System.Int32)
DO NOT USE! For internal usage only!
aPath:
restrictToWorkArea:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.HideExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SetExternalReferenceModelObjectVisibilities(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
isVisible:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SelectObjectsInExternalReferenceModel(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ZoomToExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ZoomViewToExternalReferenceModel(System.String,System.Int32)
DO NOT USE! For internal usage only!
aPath:
aViewId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SetSelectedExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelLayers(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SetExternalReferenceModelLayerVisibilities(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SetExternalReferenceModelObjectColoring(System.String,System.Double,System.Double,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
red:
green:
blue:
alpha:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ResetExternalReferenceModelColoring(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.StartExternalReferenceModelChangeDetection(System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.String,System.String)
DO NOT USE! For internal usage only!
aCurrenVersion:
aNewVersion:
changed:
inserted:
deleted:
unchanged:
comparisonSetTitle:
tolerancesTitle:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.StopExternalReferenceModelChangeDetection
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelSelections(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelSelectedEntityGuids(System.String,Tekla.Structures.ModelInternal.dotGuidList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SelectObjectsFromModel(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.LaunchExternalReferenceModelComparisonTolerancesDialog
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.LaunchExternalReferenceModelComparisonSetsDialog
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelComparisonTolerances(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelComparisonSets(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ChangeDetectionInitInProgress
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.CancelChangeDetectionInit
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelPath(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal testing usage only!
aModelTsGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetHiddenExternalObjects(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelHiddenEntityGuids(System.String,Tekla.Structures.ModelInternal.dotGuidList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.BatchGetIdentifierByGUID(Tekla.Structures.ModelInternal.dotGuidList_t@,Tekla.Structures.ModelInternal.dotIntegerIdList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetExternalReferenceModelEntitiesCount(System.String)
DO NOT USE! For internal testing usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ConvertTsGuidToIfcGuid(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aTsGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ConvertIfcGuidToTsGuid(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aIfcGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelEntityIdsFromIfcGuids(System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
Retrieves the runtime ids corresponding to the provided list of GUIDs for the specified overlay model.
path: The path to the overlay model
guids: The list of GUIDs
ids: The return list of ids

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelEntitiesIfcGuidsFromIds(System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
Retrieves the GUIDs corresponding to the provided list of runtime ids for the specified overlay model.
path: The path to the overlay model
ids: The list of ids
guids: The return list of GUIDs
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetReferenceModelObjectAttributes(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
refererenceModelObjectId:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelTCIdAndVersionId(System.String,System.String@,System.String@)
DO NOT USE! For internal usage only!
Gets the Trimble Connect model identifier and version identifier from the overlay model path.
path: The path of the imported overlay model
tcModelId: The returned TC model id
tcModelVersionId: The returned TC model version id
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetAllowedReferenceModelFileExtensions(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetReferenceModelObjectFaces(System.Int32,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
maxFaceCount:
pReferenceObjectIdentifier:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.IsValidProfile(System.String)
DO NOT USE! For internal usage only!
aProfile:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ImportBuildingHierarchyDataFromReferenceModel(System.String,System.Int32,System.Boolean)
DO NOT USE! For internal usage only!
aReferenceModelFile:
referenceModelId: '
includeSpaces:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ImportSemantic(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@,Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t@,System.Double,System.Double,System.Double)
DO NOT USE! For internal usage only!
aPath:
aBasePointGuid:
pClientId:
pSettings:
OffsetX:
OffsetY:
OffsetZ:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModel(System.String,System.String,System.String,System.String,System.String,System.String,System.Int32,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t@,Tekla.Structures.Model.Internal.IProgressReportCallback)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointType: base point type
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
info:
progressCb:

Tekla.Structures.ModelInternal.ICDelegate.ConvertReferenceModels(Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.CreateExportObjectList(System.String,System.Boolean,Tekla.Structures.ModelInternal.dotExportSelectionInfo_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SemanticTestAgainstModel(System.String,System.String,System.Boolean)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateIFC(Tekla.Structures.ModelInternal.dotCreateIFCFromModel_t@)
DO NOT USE! For internal usage only!
aIFC:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ConvertIFC4toSemantic(System.String,System.String)
DO NOT USE! For internal usage only!
ifc4File:
outputPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRevit(Tekla.Structures.ModelInternal.dotCreateRevitFromModel_t@)
DO NOT USE! For internal usage only!
aRevit:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateDgn(Tekla.Structures.ModelInternal.dotCreateDgnFromModel_t@)
DO NOT USE! For internal usage only!
aDgn:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateDwg(Tekla.Structures.ModelInternal.dotCreateDwgFromModel_t@)
DO NOT USE! For internal usage only!
aDwg:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetDSTVCoordinateSystem(Tekla.Structures.Internal.dotIdentifier_t,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
PartId:
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRunMacro(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.IsMacroRunning
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSaveAsWebModel(Tekla.Structures.ModelInternal.dotSaveAsWebModel_t@)
DO NOT USE! For internal usage only!
pSaveAsWebModel:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportConvertPartToItem(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
partId: Part ID of the original part
newItemId: Newly created item ID
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateShapeFromGeometry(System.Int32,System.String@)
DO NOT USE! For internal usage only!
partId: Part ID of the original part
shapeName: Newly created shape name
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportManipulateObject(Tekla.Structures.ModelInternal.dotManipulateObject_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportFreezeRebarSet(System.Int32,System.Boolean)
DO NOT USE! For internal usage only!
rebarSetId:
value:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportObjectsMatchToFilter(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
pClientId:
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportObjectMatchesToFilter(Tekla.Structures.Internal.dotIdentifier_t@,System.String)
DO NOT USE! For internal usage only!
pObjectId:
FileName:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportInitFilterCache
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportClearFilterCache
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.ICDelegate.ExportProgressBarOperation(Tekla.Structures.ModelInternal.dotProgressBar_t@)
DO NOT USE! For internal usage only!
pProgressBar:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDrawTemporaryText(Tekla.Structures.ModelInternal.dotDrawText_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDrawTemporaryTextToView(Tekla.Structures.ModelInternal.dotDrawText_t@,System.Int32)
DO NOT USE! For internal usage only!
pArgument:
ViewId: The ViewId, 0 for current
Returns: The id of the inserted temporary text

Tekla.Structures.ModelInternal.ICDelegate.ExportDrawTemporaryPolyLine(Tekla.Structures.ModelInternal.dotDrawPolyLine_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDrawTemporaryPolyLineWithId(Tekla.Structures.ModelInternal.dotGraphicPolyLine_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRemoveTemporaryGraphicsObjects(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDrawTemporaryPolygonSurface(Tekla.Structures.ModelInternal.dotDrawPolygonSurface_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetObjectPhase(Tekla.Structures.ModelInternal.dotPhase_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetGetPhaseProperty(Tekla.Structures.ModelInternal.dotSetGetProperty_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectPhase(Tekla.Structures.ModelInternal.dotPhase_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectLastModified(Tekla.Structures.Internal.dotIdentifier_t@,System.Int32@,System.Boolean@)
DO NOT USE! For internal usage only!
pIdentifier:
pTime:
pLocallyModified:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectNumberedStatus(Tekla.Structures.Internal.dotIdentifier_t@,System.Boolean@)
DO NOT USE! For internal usage only!
pIdentifier:
pLocallyNumbered:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetPhaseNumbers(Tekla.Structures.ModelInternal.dotPhaseNumbers_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetModificationStamp(Tekla.Structures.ModelInternal.dotModificationStamp_t@)
DO NOT USE! For internal usage only!
pModStmp:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportInsertView(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
OpenView:
UseAppliedValues:
View:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportInsertViewByStandardFile(System.String,Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
fileName:
View:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
View:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pView:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetViews(Tekla.Structures.ModelInternal.dotViewSelector_t@)
DO NOT USE! For internal usage only!
pViews:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCurrentView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pView:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetActiveView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pView:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetActiveView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pView:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetViewPointFromCurrentView(Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
pViewPoint:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.SetViewVisibilityFilterValue(System.Int32,System.String)
DO NOT USE! For internal usage only!
viewId: The model view Id.
viewVisibilityFilterValue: The view visibility filter value.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetViewVisibilityFilterValue(System.Int32,System.String@)
DO NOT USE! For internal usage only!
viewId: The model view Id.
viewVisibilityFilterValue: The view visibility filter value.
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetRepresentation(System.String)
DO NOT USE! For internal usage only!
Representation:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetViewPartRepresentationState(System.Int32)
DO NOT USE! For internal usage only!
RepresentationState:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportViewHideUnselected(System.Boolean,System.Boolean)
DO NOT USE! For internal usage only!
HideCompletely:
DrawAsStick:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetClipPlanes(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotGetClipPlanes_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotGetClipPlanes:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectExtremaBoxData(Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t@)
DO NOT USE! For internal usage only!
pGetObjectExtremaBoxData:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotClipPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotClipPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotClipPlane:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
Creates a clip box in the view.
pView: The view structure.
pClipBox: The clip box structure containing 6 clip planes.
Returns: Result code > 0 on success.

Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
Deletes a clip box from the view.
pView: The view structure.
pClipBox: The clip box structure.
Returns: Result code > 0 on success.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
Modifies a clip box in the view.
pView: The view structure.
pClipBox: The clip box structure containing updated clip planes.
Returns: Result code > 0 on success.

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTransformPlaneAsWorkFloor
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryState(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum@)
DO NOT USE! For internal usage only!
pObjectId:
pNewState:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryStates(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryStates:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryStates_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier}@,Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pObjects:
pSetTemporaryStates:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pObjectId:
pNewColor:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pObjectId:
pNewColor:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryColors(Tekla.Structures.ModelInternal.dotSetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pSetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetTemporaryColors(Tekla.Structures.ModelInternal.dotGetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pGetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryState:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportResetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryState:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetTemporaryColors_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier}@,Tekla.Structures.ModelInternal.dotSetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pObjects:
pSetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportClearTemporaryState(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pObjectId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportClearTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pObjectId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportClearAllTemporaryStates
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportUnhideParts
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetViewCamera(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotCamera_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotCamera:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSetViewCamera(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotCamera_t@)
DO NOT USE! For internal usage only!
pDotView:
pDotCamera:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportAllowAutoSave(System.Boolean)
DO NOT USE! For internal usage only!
allowed:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportChangeManagerAllowSave(System.Boolean)
DO NOT USE! For internal usage only!
SaveFlag:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportChangeManagerAllowNumbering(System.Boolean)
DO NOT USE! For internal usage only!
NumberingFlag:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportShadowArea(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportShadowAreaComplement(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetColorRepresentationForObject(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pColor:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetReferenceModelObjectByExternalGuid(System.Int32,Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
referenceModelId:
externalGuid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportCheckObject1ModifiedAfterObject2(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
object1:
object2:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportObjectIncludedToCopyOrMoveOperation(Tekla.Structures.Internal.dotIdentifier_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportObjectsIncludedToCopyOrMoveOperation(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetBeamPositioningBox(Tekla.Structures.ModelInternal.dotBeamPositioningBox_t@)


Tekla.Structures.ModelInternal.ICDelegate.GrdrShowPreviewDrawing(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportDasStartCommand(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.ExportDasStartAction(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.ExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportUndoOperation(Tekla.Structures.ModelInternal.dotUndoOperation_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetDataBaseVersionInfoFromModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportBhMoveObjects(Tekla.Structures.ModelInternal.dotClientId_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateNewModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSharingOperation(Tekla.Structures.ModelInternal.dotSharingOperation_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModel2Operation(Tekla.Structures.ModelInternal.dotModel2Operation_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportExternalDrawOperation(Tekla.Structures.ModelInternal.dotExternalDrawOperation_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportTranslateLabel(Tekla.Structures.ModelInternal.dotTranslateLabel_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ImportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetModificationStampGuid(System.String@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetWriteOutStampGuid(System.String@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetSetModstamp(Tekla.Structures.ModelInternal.dotModStamp_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModStampCompare(Tekla.Structures.ModelInternal.dotModStampCompare_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportChangeLegFaceLayer(System.Collections.Generic.List{System.Int32}@,System.Int32,System.Int32)
DO NOT USE! For internal usage only.
dotLegFaces:
rebarSetId:
change:
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only.
singleRebarId: The single rebar ID.
Returns: The rebar set ID if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: The guid to identify the shape
clientId: The client ID to identify the connection
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifySurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateSurfaceByFaceAndAttrib(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetAssociateSurfaces(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetParentObject(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetAssemblyId(System.Int32,System.Int32@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectAssemblyPrimary(System.Int32,System.Int32@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetSurfaceGeometryType(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetDatabaseVersion(System.Int32@)


Tekla.Structures.ModelInternal.ICDelegate.ExportRunDataRetrieverCommand(System.String)
DO NOT USE! For internal usage only!
parameter: Parameters for command.
Returns: True on success.

Tekla.Structures.ModelInternal.ICDelegate.ExportFingerprint(Tekla.Structures.ModelInternal.dotPolymesh_t@,System.String@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCompareFingerprints(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.ExportRenderGraphicContainer(System.Int32,Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicLine}@,System.Collections.Generic.List{Tekla.Structures.Model.UI.GraphicPolyLine}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicFace}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicText}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteGraphicObjectContainer(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportDeleteAllGraphicObjectContainers(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportMarkObjectModifiedForOrganizer(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetPartContour(System.Int32,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModelTestingFeaturesHandler(Tekla.Structures.ModelInternal.dotModelTestingFeaturesHandler_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModelFeaturesHandler(Tekla.Structures.ModelInternal.dotModelFeaturesHandler_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportBatchEditorHandler(Tekla.Structures.ModelInternal.dotBatchEditorHandler_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportFabricationHandler(Tekla.Structures.ModelInternal.dotFabricationHandler_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSetPrintingController(Tekla.Structures.ModelInternal.IPrintingController)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetPrintingController(Tekla.Structures.ModelInternal.IPrintingController@)


Tekla.Structures.ModelInternal.ICDelegate.ExportCalculateContourPolycurve(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetObjectAttribute(System.Int32,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetAvailableCustomPropertyNames(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.AutomatedTesting_BroadcastMessage(System.String)


Tekla.Structures.ModelInternal.ICDelegate.WriteTrbCreatedEvent


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateViewSnapshotToFile(System.String,System.Int32,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)
DO NOT USE! For internal usage only!
Creates a snapshot of the view to the specified filepath.
filePath: The filepath.
viewId: The view id.
settings: The snapshot settings.
overwrite: The option to overwrite or not existing snapshots.
Returns: True if the snapshot creation succeeded, false otherwise.

Tekla.Structures.ModelInternal.ICDelegate.StartLiveSharing(Tekla.Structures.Model.Internal.IChangeSetCreatedCallback,System.Guid,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.StopLiveSharing(System.Guid)


Tekla.Structures.ModelInternal.ICDelegate.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32,Tekla.Structures.Model.Internal.ICancellableProgressReportCallback)


Tekla.Structures.ModelInternal.ICDelegate.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.AddChangeSet(System.String,System.String,System.Byte[])


Tekla.Structures.ModelInternal.ICDelegate.RemoveChangeSet(System.String)


Tekla.Structures.ModelInternal.ICDelegate.GetEventTimeGuid(System.String)


Tekla.Structures.ModelInternal.ICDelegate.EventsDbTimeOrdered(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.WriteEventToDatabase(System.String)


Tekla.Structures.ModelInternal.ICDelegate.RenameEvent(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.HighlightSelectedBoltParts(System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.HighlightConnectedObjects(System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.ICDelegate.UnhighlightConnectedObjects


Tekla.Structures.ModelInternal.ICDelegate.GetTSLanguageCultureString


Tekla.Structures.ModelInternal.ICDelegate.GetAvailableProfiles(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.GetAvailableMaterials(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.GetNumberingTemporaryRecordList


Tekla.Structures.ModelInternal.ICDelegate.GetNumberingSettings(Tekla.Structures.ModelInternal.dotNumberingSettingsType_t@)


Tekla.Structures.ModelInternal.ICDelegate.GetReportProperty(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.RegisterAssertCallback(Tekla.Structures.Model.Internal.IAssertEventCallback)


Tekla.Structures.ModelInternal.ICDelegate.RunNumberingCommandWithPreview(System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.ICDelegate.AcceptNumberingResults


Tekla.Structures.ModelInternal.ICDelegate.RejectNumberingResults


Tekla.Structures.ModelInternal.ICDelegate.CheckABMNumbering(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotCheckABMResult_t}@)


Tekla.Structures.ModelInternal.ICDelegate.GetDeletedSubmittedPartsCount(System.String)


Tekla.Structures.ModelInternal.ICDelegate.ProcessABMNumbering(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.ICDelegate.UnnumberProcurementParts(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.ICDelegate.SendCustomPartsToABMNumbering(System.Collections.Generic.List{System.Int32},System.String,System.String@,System.String@)


Tekla.Structures.ModelInternal.ICDelegate.GetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.ICDelegate.SetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.ICDelegate.ClearOldFabricatorSettings


Tekla.Structures.ModelInternal.ICDelegate.IsValidFabricatorProfile(System.String)


Tekla.Structures.ModelInternal.ICDelegate.GetNormalizedPlateProfileName(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.IsValidFabricatorMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.IsValidFabricatorFinish(System.String)


Tekla.Structures.ModelInternal.ICDelegate.IsProfileAccepted(System.String)


Tekla.Structures.ModelInternal.ICDelegate.IsMaterialAccepted(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.IsFinishAccepted(System.String)


Tekla.Structures.ModelInternal.ICDelegate.AddAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.ICDelegate.AddAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.AddAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.ICDelegate.DeleteAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.ICDelegate.DeleteAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.ICDelegate.DeleteAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.ICDelegate.ClearVirtualBarCache


Tekla.Structures.ModelInternal.ICDelegate.ExportGetHiddenObjects(Tekla.Structures.ModelInternal.dotIntegerIdList_t@)


Tekla.Structures.ModelInternal.ICDelegate.ShowAssembliesHierarchy(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.ICDelegate.GetMousePositionInModelCoordinates(Tekla.Structures.Internal.dotPoint_t@)
